{
    "basePath": "/",
    "swaggerVersion": "1.1",
    "apiVersion": "0.1",
    "apis": [
        {
            "operations": [
                {
                    "errorResponses": [
                        {
                            "reason": "is returned when the array of endpoints can be determined successfully. <br><br>",
                            "code": "200"
                        },
                        {
                            "reason": "is returned if the action is not carried out in the system database. <br><br>",
                            "code": "400"
                        },
                        {
                            "reason": "The server will respond with <em>HTTP 405</em> if an unsupported HTTP method is used. <br><br>",
                            "code": "405"
                        }
                    ],
                    "parameters": [],
                    "notes": "Returns an array of all configured endpoints the server is listening on. For each endpoint, the array of allowed databases is returned too if set. <br><br> The result is a JSON object which has the endpoints as keys, and an array of mapped database names as values for each endpoint. <br><br> If an array of mapped databases is empty, it means that all databases can be accessed via the endpoint. If an array of mapped databases contains more than one database name, this means that any of the databases might be accessed via the endpoint, and the first database in the arry will be treated as the default database for the endpoint. The default database will be used when an incoming request does not specify a database name in the request explicitly. <br><br> <em>Note</em>: retrieving the array of all endpoints is allowed in the system database only. Calling this action in any other database will make the server return an error. <br><br>",
                    "summary": " Return list of all endpoints",
                    "httpMethod": "GET",
                    "examples": "<br><br><br><br><pre><code class=\"json\">shell&gt; curl --dump - http://localhost:8529/_api/endpoint\n\nHTTP/1.1 200 OK\ncontent-type: application/json; charset=utf-8\n\n[ \n  { \n    \"endpoint\" : \"tcp://127.0.0.1:39893\", \n    \"databases\" : [ ] \n  } \n]\n</code></pre><br><br><br>",
                    "nickname": "ReturnListOfAllEndpoints"
                }
            ],
            "path": "/_api/endpoint"
        }
    ]
}
